[
  {
    "name_my": "[PAGI] Ditetapkan Islam",
    "name_en": "[MORNING] Firmly Islam",
    "content": "أصْبَحْنَا عَلَى فِطْرَةِ الإِسْلاَمِ وَعَلَى كَلِمَةِ الإِخْلاَصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
    "reference_my": "Riwayat Ahmad (15360)",
    "reference_en": "Narrated by Ahmad (15360)",
    "meaning_my": "Kami hayati pagi ini di atas landasan fitrah dan perwatakan Islam, berpegang kepada kalimah ikhlas (kalimah syahadah), dan berpegang kepada agama Nabi kami Muhammad SAW yang juga agama ayah kami Ibrahim, yang berada di atas jalan yang lurus, muslim dan tidak tergolong dalam golongan orang-orang yang musyrik",
    "meaning_en": "We rise upon the fitrah of al-Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad SAW and the religion of our forefather Ibrahim who was a Muslim and of true faith and was not of those who associate others with Allah",
    "category_names": ["Bacaan Pagi", "Morning Supplication"]
  },
  {
    "name_my": "[PETANG] Ditetapkan Islam",
    "name_en": "[EVENING] Firmly Islam",
    "content": "أمْسَيْنَا عَلَى فِطْرَةِ الإِسْلاَمِ وَعَلَى كَلِمَةِ الإِخْلاَصِ وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَعَلَى مِلَّةِ أَبِينَا إِبْرَاهِيمَ حَنِيفًا مُسْلِمًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ",
    "reference_my": "Riwayat Ahmad (15360)",
    "reference_en": "Narrated by Ahmad (15360)",
    "meaning_my": "Kami hayati petang ini di atas landasan fitrah dan perwatakan Islam, berpegang kepada kalimah ikhlas (kalimah syahadah), dan berpegang kepada agama Nabi kami Muhammad SAW yang juga agama ayah kami Ibrahim, yang berada di atas jalan yang lurus, muslim dan tidak tergolong dalam golongan orang-orang yang musyrik",
    "meaning_en": "We live this evening grounded in the natural disposition of Islam, and the word of pure faith, and upon the religion of our Prophet Muhammad SAW and the religion of our forefather Ibrahim who was a Muslim and of true faith and was not of those who associate others with Allah",
    "category_names": ["Bacaan Petang", "Evening Supplication"]
  },
  {
    "name_my": "Penghulu Bagi Doa Keampunan",
    "name_en": "The Master of Forgiveness Prayer",
    "content": "اَللَّهُمَّ أَنْتَ رَبِّيْ لاَإِلَهَ إِلاَّأَنْتَ خَلَقْتَنِيْ وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ فإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّأَنْتَ",
    "reference_my": "Riwayat al-Bukhari (6306)",
    "reference_en": "Narrated by Bukhari (6306)",
    "meaning_my": "Ya Allah, Engkau adalah Tuhanku, tidak ada Tuhan yang berhak disembah kecuali Engkau, Engkaulah yang menciptakanku dan aku adalah hamba-Mu. Aku akan setia pada perjanjianku pada-Mu (iaitu aku akan mentauhidkan-Mu) dan aku yakin akan jaji-Mu (berupa syurga untukku) dengan sedaya upayaku. Aku berlindung kepada-Mu dari kejahatan yang aku lakukan. Aku mengakui nikmat-Mu kepadaku dan aku mengakui dosaku, maka, ampunilah aku. Sesungguhnya tiada yang mengampuni dosa kecuali Engkau",
    "meaning_en": "O Allah, You are my Lord, there is no deity worthy of worship except You, You created me and I am Your servant. I am committed to my covenant with You (to worship You alone) and believe in Your promise (of Paradise for me) to the best of my ability. I seek refuge in You from the evil of what I have done. I acknowledge Your blessings upon me and I confess my sins, so forgive me. Indeed, none can forgive sins except You.",
    "category_names": ["Keampunan", "Forgiveness", "Taubat", "Repentance"]
  },
  {
    "name_my": "[JEMAAH] Penghulu Bagi Doa Keampunan",
    "name_en": "[JAMA'AH] The Master of Forgiveness Prayer",
    "content": "اَللَّهُمَّ أَنْتَ رَبُّنَا لاَإِلَهَ إِلاَّأَنْتَ خَلَقْتَنَا وَنَحْنُ عِبَادُكَ وَنَحْنُ عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْنَا نَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْنَا نَبُوْءُ لَكَ بِنِعْمَتِكَ عَلَيْنَا وَنَبُوْءُ بِذُنُبِنَا فَاغْفِرْ لَنَا فإِنَّهُ لاَ يَغْفِرُ الذُّنُوْبَ إِلاَّأَنْتَ",
    "reference_my": "Riwayat al-Bukhari (6306)",
    "reference_en": "Narrated by Bukhari (6306)",
    "meaning_my": "Ya Allah, Engkau adalah Tuhan kami, tidak ada Tuhan yang berhak disembah kecuali Engkau, Engkaulah yang menciptakan kami dan kami adalah hamba-Mu. Kami akan setia pada perjanjian kami pada-Mu dan jaji-Mu dengan sedaya upaya kami. Kami berlindung kepada-Mu dari kejahatan yang kami lakukan. Kami mengakui nikmat-Mu kepada kami dan kami mengakui dosa kami, maka, ampunilah kami. Sesungguhnya tiada yang mengampuni dosa kecuali Engkau",
    "meaning_en": "O Allah, You are our Lord, there is no deity worthy of worship except You, You created us and we are Your servants. We are committed to our covenant with You and to Your promise with all our might. We seek refuge in You from the evil of what we have done. We acknowledge Your blessings upon us and confess our sins, so forgive us. Indeed, none can forgive sins except You.",
    "category_names": [
      "Keampunan",
      "Forgiveness",
      "Taubat",
      "Repentance",
      "Jamaah"
    ]
  },
  {
    "name_my": "Mohon Keampunan",
    "name_en": "Seeking Forgiveness",
    "content": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِرًا وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
    "reference_my": "Riwayat al-Bukhari (7387) dan Muslim (2705)",
    "reference_en": "Narrated by Bukhari (7387) and Muslim (2705)",
    "meaning_my": "Ya Allah! Sungguh aku telah menzalimi diriku sendiri dengan kezaliman yang banyak, sedangkan tidak ada yang dapat mengampuni dosa-dosa kecuali Engkau. Maka ampunilah aku dengan suatu pengampunan dari sisi-Mu, dan rahmatilah aku. Sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang",
    "meaning_en": "O Allah! Indeed, I have wronged myself greatly, and none can forgive sins except You. So grant me forgiveness from Yourself, and have mercy on me. Indeed, You are the Forgiving, the Merciful.",
    "category_names": ["Keampunan", "Forgiveness", "Taubat", "Repentance"]
  },
  {
    "name_my": "[JEMAAH] Mohon Keampunan",
    "name_en": "[JAMA'AH] Seeking Forgiveness",
    "content": "اللَّهُمَّ إِنَّا ظَلَمْنَا أَنْفُسَنَا ظُلْمًا كَثِيرًا وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لَنَا مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنَا إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
    "reference_my": "Riwayat al-Bukhari (7387) dan Muslim (2705)",
    "reference_en": "Narrated by Bukhari (7387) and Muslim (2705)",
    "meaning_my": "Ya Allah! Sungguh kami telah menzalimi diri kami dengan kezaliman yang banyak, sedangkan tidak ada yang dapat mengampuni dosa-dosa kecuali Engkau. Maka ampunilah kami dengan suatu pengampunan dari sisi-Mu, dan rahmatilah kami. Sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang",
    "meaning_en": "O Allah! Indeed, we have wronged ourselves greatly, and none can forgive sins except You. So grant us forgiveness from Yourself, and have mercy on us. Indeed, You are the Forgiving, the Merciful.",
    "category_names": [
      "Keampunan",
      "Forgiveness",
      "Taubat",
      "Repentance",
      "Jamaah"
    ]
  },
  {
    "name_my": "Mohon Taqwa",
    "name_en": "Seeking Piety",
    "content": "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلَاهَا",
    "reference_my": "Riwayat Muslim (2722)",
    "reference_en": "Narrated by Muslim (2722)",
    "meaning_my": "Ya Allah, berikanlah ketakwaan pada jiwaku, dan bersihkanlah ia kerana Engkaulah  sebaik-baik yang dapat membersihkannya. Engkaulah pelindung dan Tuan kepadanya",
    "meaning_en": "O Allah, grant piety to my soul, and cleanse it for You are the best to cleanse it. You are its Protector and Lord",
    "category_names": ["Piety", "Taqwa"]
  },
  {
    "name_my": "[JEMAAH] Mohon Taqwa",
    "name_en": "[JAMA'AH]Seeking Piety",
    "content": "اللَّهُمَّ آتِ نُفُوْسَنَا تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا أَنْتَ وَلِيُّهَا وَمَوْلَاهَا",
    "reference_my": "Riwayat Muslim (2722)",
    "reference_en": "Narrated by Muslim (2722)",
    "meaning_my": "Ya Allah, berikanlah ketakwaan pada jiwa kami, dan bersihkanlah ia kerana Engkaulah  sebaik-baik yang dapat membersihkannya. Engkaulah pelindung dan Tuan kepadanya",
    "meaning_en": "O Allah, grant piety to our soul, and cleanse it for You are the best to cleanse it. You are its Protector and Lord",
    "category_names": ["Piety", "Taqwa", "Jamaah"]
  },
  {
    "name_my": "Pengiktirafan",
    "name_en": "Recognition",
    "content": "لَّآ إِلَـٰهَ إِلَّآ أَنتَ سُبْحَـٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّـٰلِمِينَ",
    "reference_my": "Surah Al-Anbiya' (21:87)",
    "reference_en": "Surah Al-Anbiya' (21:87)",
    "meaning_my": "Sesungguhnya tiada Tuhan (yang dapat menolong) melainkan Engkau, Maha Suci Engkau (daripada melakukan aniaya, tolongkanlah daku)! Sesungguhnya aku adalah daripada orang-orang yang menganiaya diri sendiri",
    "meaning_en": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers",
    "category_names": ["Pengiktirafan", "Recognition"]
  },
  {
    "name_my": "Kelapangan Hati dan Jiwa",
    "name_en": "Tranquility of Heart and Soul",
    "content": "اللَّهُمَّ إِنِّي عَبْدُكَ ، وَابْنُ عَبْدِكَ ، وَابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤُكَ ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجِلَاءَ حُزْنِي ، وَذَهَابَ هَمِّي",
    "reference_my": "Riwayat Ahmad (3712)",
    "reference_en": "Narrated by Ahmad (3712)",
    "meaning_my": "Ya Allah, sesungguhnya aku adalah hamba-Mu, anak kepada hamba-Mu, anak kepada hamba perempuan-Mu, ubun-ubunku di tangan-Mu, telah berlalunya keputusan-Mu, Engkau telah berlaku adil ke atas aku dalam keputusan-Mu. Aku memohon kepada-Mu dengan setiap nama yang Engkau berikan pada diri-Mu, atau yang telah Engkau ajarkan kepada salah satu makhluk ciptaan-Mu, atau yang telah Engkau turunkan dalam kitab-Mu, atau yang telah Engkau rahsiakan dalam ilmu ghaib-Mu, untuk menjadikan al-Quran sebagai penyejuk hatiku, cahaya di dadaku, penghilang kesedihanku, penghapus kesusahanku.",
    "meaning_en": "O Allah, indeed I am Your servant, son of Your male servant, son of Your female servant, my forelock is in Your hand, Your command over me is forever executed and Your decree over me is just. I ask You by every name belonging to You which You named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, to make the Quran the spring of my heart, the light of my chest, the banisher of my sadness, and the reliever of my distress.",
    "category_names": ["Tenang", "Hati", "Jiwa", "Calm", "Heart", "Soul"]
  },
  {
    "name_my": "[JEMAAH] Kelapangan Hati dan Jiwa",
    "name_en": "[JAMA'AH] Tranquility of Heart and Soul",
    "content": "اللَّهُمَّ إِنَّا عَبِيْدُكَ ، وَبَنُوْ عَبِيْدِكَ ، وَبَنُوْ أَمَايِـكَ ، نَوَاصِيْنَا بِيَدِكَ ، مَاضٍ فِيْنَا حُكْمُكَ ، عَدْلٌ فِيْنَ قَضَاؤُكَ ، نَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ ، أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الْغَيْبِ عِنْدَكَ ، أَنْ تَجْعَلَ الْقُرْآنَ رَبِيعَ قُلُوْبِنَا ، وَنُورَ صُدُوْرِنَا ، وَجِلَاءَ أَحْزَانِنَا ، وَذَهَابَ هُمُوْمِنَا",
    "reference_my": "Riwayat Ahmad (3712)",
    "reference_en": "Narrated by Ahmad (3712)",
    "meaning_my": "Ya Allah, sesungguhnya kami adalah hamba-Mu, anak kepada hamba-Mu, anak kepada hamba perempuan-Mu, ubun-ubun kami di tangan-Mu, telah berlalunya keputusan-Mu, Engkau telah berlaku adil ke atas kami dalam keputusan-Mu. Kami memohon kepada-Mu dengan setiap nama yang Engkau berikan pada diri-Mu, atau yang telah Engkau ajarkan kepada salah satu makhluk ciptaan-Mu, atau yang telah Engkau turunkan dalam kitab-Mu, atau yang telah Engkau rahsiakan dalam ilmu ghaib-Mu, untuk menjadikan al-Quran sebagai penyejuk hati kami, cahaya di dada kami, penghilang kesedihan kami, penghapus kesusahan kami.",
    "meaning_en": "O Allah, indeed we are Your servants, sons of Your male servants, sons of Your female servants, our forelocks are in Your hand, Your command over us is forever executed and Your decree over us is just. We ask You by every name belonging to You which You named Yourself with, or revealed in Your Book, or You taught to any of Your creation, or You have preserved in the knowledge of the unseen with You, to make the Quran the spring of our hearts, the light of our chests, the banisher of our sadness, and the reliever of our distress.",
    "category_names": [
      "Tenang",
      "Hati",
      "Jiwa",
      "Calm",
      "Heart",
      "Soul",
      "Jamaah"
    ]
  },
  {
    "name_my": "Keluar dari Rumah",
    "name_en": "Leaving the House",
    "content": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "reference_my": "Riwayat Abu Daud (5096)",
    "reference_en": "Narrated by Abu Daud (5096)",
    "meaning_my": "Dengan nama Allah, aku bertawakkal kepada Allah. Tiada upaya dan tiada kekuatan kecuali dengan Allah",
    "meaning_en": "In the name of Allah, I place my trust in Allah. There is no might nor power except with Allah",
    "category_names": ["Selamat", "Safety", "Protection", "Perlindungan"]
  },
  {
    "name_my": "[JEMAAH] Keluar dari Rumah",
    "name_en": "[JAMA'AH] Leaving the House",
    "content": "بِسْمِ اللَّهِ تَوَكَّلْنَا عَلَى اللَّهِ لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "reference_my": "Riwayat Abu Daud (5096)",
    "reference_en": "Narrated by Abu Daud (5096)",
    "meaning_my": "Dengan nama Allah, kami bertawakkal kepada Allah. Tiada upaya dan tiada kekuatan kecuali dengan Allah",
    "meaning_en": "In the name of Allah, we place our trust in Allah. There is no might nor power except with Allah",
    "category_names": [
      "Selamat",
      "Safety",
      "Protection",
      "Perlindungan",
      "Jamaah"
    ]
  },
  {
    "name_my": "Petunjuk, Ketaqwaan, Iffah dan Kekayaan",
    "name_en": "Guidance, Piety, Chastity and Wealth",
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
    "reference_my": "Riwayat Muslim (2721)",
    "reference_en": "Narrated by Muslim (2721)",
    "meaning_my": "Ya Allah, sesungguhnya aku memohon kepada-Mu petunjuk, ketaqwaan, kesucian dan kekayaan",
    "meaning_en": "O Allah, indeed I ask You for guidance, piety, chastity and wealth",
    "category_names": [
      "Petunjuk",
      "Guidance",
      "Taqwa",
      "Piety",
      "Iffah",
      "Chastity",
      "Kekayaan",
      "Wealth"
    ]
  },
  {
    "name_my": "[JEMAAH] Petunjuk, Ketaqwaan, Iffah dan Kekayaan",
    "name_en": "[JAMA'AH] Guidance, Piety, Chastity and Wealth",
    "content": "اللَّهُمَّ إِنَّا نَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
    "reference_my": "Riwayat Muslim (2721)",
    "reference_en": "Narrated by Muslim (2721)",
    "meaning_my": "Ya Allah, sesungguhnya kami memohon kepada-Mu petunjuk, ketaqwaan, kesucian dan kekayaan",
    "meaning_en": "O Allah, indeed we ask You for guidance, piety, chastity and wealth",
    "category_names": [
      "Petunjuk",
      "Guidance",
      "Taqwa",
      "Piety",
      "Iffah",
      "Chastity",
      "Kekayaan",
      "Wealth",
      "Jamaah"
    ]
  },
  {
    "name_my": "Ilmu, Rezeki dan Amalan yang Diterima",
    "name_en": "Knowledge, Sustenance and Accepted Deeds",
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
    "reference_my": "Riwayat Ibn Majah (925)",
    "reference_en": "Narrated by Ibn Majah (925)",
    "meaning_my": "Ya Allah, sesungguhnya aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik dan amalan yang diterima",
    "meaning_en": "O Allah, indeed I ask You for beneficial knowledge, good sustenance and deeds that are accepted",
    "category_names": [
      "Ilmu",
      "Knowledge",
      "Rezeki",
      "Sustenance",
      "Amalan",
      "Deeds"
    ]
  },
  {
    "name_my": "[JEMAAH] Ilmu, Rezeki dan Amalan yang Diterima",
    "name_en": "[JAMA'AH] Knowledge, Sustenance and Accepted Deeds",
    "content": "اللَّهُمَّ إِنَّا نَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلاً مُتَقَبَّلاً",
    "reference_my": "Riwayat Ibn Majah (925)",
    "reference_en": "Narrated by Ibn Majah (925)",
    "meaning_my": "Ya Allah, sesungguhnya kami memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik dan amalan yang diterima",
    "meaning_en": "O Allah, indeed we ask You for beneficial knowledge, good sustenance and deeds that are accepted",
    "category_names": [
      "Ilmu",
      "Knowledge",
      "Rezeki",
      "Sustenance",
      "Amalan",
      "Deeds",
      "Jamaah"
    ]
  },
  {
    "name_my": "Pertolongan Untuk Zikir",
    "name_en": "Help for Remembrance",
    "content": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "reference_my": "Riwayat Abu Daud (1522)",
    "reference_en": "Narrated by Abu Daud (1522)",
    "meaning_my": "Ya Allah, tolonglah aku untuk berzikir kepada-Mu, bersyukur kepada-Mu dan beribadah kepada-Mu dengan sebaik-baiknya",
    "meaning_en": "O Allah, help me to remember You, to be grateful to You and to worship You in the best manner",
    "category_names": [
      "Zikir",
      "Remembrance",
      "Syukur",
      "Gratitude",
      "Ibadah",
      "Worship"
    ]
  },
  {
    "name_my": "[JEMAAH] Pertolongan Untuk Zikir",
    "name_en": "[JAMA'AH] Help for Remembrance",
    "content": "اللَّهُمَّ أَعِنَّا عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ",
    "reference_my": "Riwayat Abu Daud (1522)",
    "reference_en": "Narrated by Abu Daud (1522)",
    "meaning_my": "Ya Allah, tolonglah kami untuk berzikir kepada-Mu, bersyukur kepada-Mu dan beribadah kepada-Mu dengan sebaik-baiknya",
    "meaning_en": "O Allah, help us to remember You, to be grateful to You and to worship You in the best manner",
    "category_names": [
      "Zikir",
      "Remembrance",
      "Syukur",
      "Gratitude",
      "Ibadah",
      "Worship",
      "Jamaah"
    ]
  },
  {
    "name_my": "Keampunan",
    "name_en": "Forgiveness",
    "content": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنِّي",
    "reference_my": "Riwayat Tirmidzi (3513)",
    "reference_en": "Narrated by Tirmidzi (3513)",
    "meaning_my": "Ya Allah, sesungguhnya Engkau Maha Pengampun dan suka memberi keampunan, maka ampunilah aku",
    "meaning_en": "O Allah, indeed You are the Most Forgiving and You love forgiveness, so forgive me",
    "category_names": ["Keampunan", "Forgiveness", "Lailatul Qadar"]
  },
  {
    "name_my": "[JEMAAH] Keampunan",
    "name_en": "[JAMA'AH] Forgiveness",
    "content": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ الْعَفْوَ فَاعْفُ عَنَّا",
    "reference_my": "Riwayat Tirmidzi (3513)",
    "reference_en": "Narrated by Tirmidzi (3513)",
    "meaning_my": "Ya Allah, sesungguhnya Engkau Maha Pengampun dan suka memberi keampunan, maka ampunilah kami",
    "meaning_en": "O Allah, indeed You are the Most Forgiving and You love forgiveness, so forgive us",
    "category_names": ["Keampunan", "Forgiveness", "Lailatul Qadar", "Jamaah"]
  },
  {
    "name_my": "Ditetapkan Hati",
    "name_en": "Firmness of Heart",
    "content": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِيْنِكَ",
    "reference_my": "Riwayat Tirmidzi (3522)",
    "reference_en": "Narrated by Tirmidzi (3522)",
    "meaning_my": "Wahai Tuhan yang membolak-balikkan hati, tetapkanlah hatiku di atas agama-Mu",
    "meaning_en": "O Turner of the hearts, make my heart firm upon Your religion",
    "category_names": ["Hati", "Heart", "Firmness"]
  },
  {
    "name_my": "[JEMAAH] Ditetapkan Hati",
    "name_en": "[JAMA'AH] Firmness of Heart",
    "content": "يَا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قُلُوْبَنَا عَلَى دِيْنِكَ",
    "reference_my": "Riwayat Tirmidzi (3522)",
    "reference_en": "Narrated by Tirmidzi (3522)",
    "meaning_my": "Wahai Tuhan yang membolak-balikkan hati, tetapkanlah hati kami di atas agama-Mu",
    "meaning_en": "O Turner of the hearts, make our hearts firm upon Your religion",
    "category_names": ["Hati", "Heart", "Firmness", "Jamaah"]
  },
  {
    "name_my": "Minta Kebaikan dan Menolak Kejahatan",
    "name_en": "Seeking Goodness and Rejecting Evil",
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ، اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْرًا",
    "reference_my": "Riwayat Ibn Majah (3846), Ahmad (25180), al-Tabarani (2/252) dan Ibn Hibban (458)",
    "reference_en": "Narrated by Ibn Majah (3846), Ahmad (25180), al-Tabarani (2/252) and Ibn Hibban (458)",
    "meaning_my": "Ya Allah, aku memohon kepada-Mu semua kebaikan yang disegerakan mahupun yang ditunda, serta apa yang aku ketahui mahupun tidak aku ketahui. Aku berlindung kepada-Mu dari semua keburukan, baik yang disegerakan mahupun yang ditunda, yang aku ketahui mahupun yang tidak aku ketahui. Ya Allah, sungguh aku memohon kepada-Mu dari kebaikan apa yang diminta oleh hamba dan Nabi-Mu Muhammad SAW kepada-Mu dan aku berlindung kepada-Mu dari apa yang diminta perlindungan oleh hamba dan nabi-Mu. Ya Allah, aku memohon kepada-Mu syurga dan apa yang mendekatkan kepadanya baik berupa ucapan mahupun perbuatan. Dan aku berlindung kepada-Mu dari neraka dan apa yang mendekatkan kepadanya baik berupa ucapan atau perbuatan. Dan aku memohon kepada-Mu semua takdir yang Engkau tentukan baik untukku.",
    "meaning_en": "O Allah, I ask You for all goodness, whether I know it or not, whether it is immediate or delayed. I seek refuge in You from all evil, whether I know it or not, whether it is immediate or delayed. O Allah, I ask You for the good asked for by Your slave and Your Prophet, and I seek refuge in You from the evil sought refuge from by Your slave and Your Prophet. O Allah, I ask You for Paradise and whatever brings one closer to it in word or deed. And I seek refuge in You from the Fire and whatever brings one closer to it in word or deed. And I ask You for every decree that You have decreed concerning me to be good.",
    "category_names": [
      "Meminta Kebaikan",
      "Menolak Kejahatan",
      "Seeking Goodness",
      "Rejecting Evil"
    ]
  },
  {
    "name_my": "[JEMAAH] Minta Kebaikan dan Menolak Kejahatan",
    "name_en": "[JAMA'AH] Seeking Goodness and Rejecting Evil",
    "content": "اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْنَا مِنْهُ وَمَا لَمْ نَعْلَمْ، وَنَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْنَا مِنْهُ وَمَا لَمْ نَعْلَمْ، اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ، وَنَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ، اللَّهُمَّ إِنَّا نَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَنَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ، وَنَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لَنَا خَيْرًا",
    "reference_my": "Riwayat Ibn Majah (3846), Ahmad (25180), al-Tabarani (2/252) dan Ibn Hibban (458)",
    "reference_en": "Narrated by Ibn Majah (3846), Ahmad (25180), al-Tabarani (2/252) and Ibn Hibban (458)",
    "meaning_my": "Ya Allah, kami memohon kepada-Mu semua kebaikan yang disegerakan mahupun yang ditunda, serta apa yang kami ketahui mahupun tidak kami ketahui. Kami berlindung kepada-Mu dari semua keburukan, baik yang disegerakan mahupun yang ditunda, yang kami ketahui mahupun yang tidak kami ketahui. Ya Allah, sungguh kami memohon kepada-Mu dari kebaikan apa yang diminta oleh hamba dan Nabi-Mu Muhammad SAW kepada-Mu dan kami berlindung kepada-Mu dari apa yang diminta perlindungan oleh hamba dan nabi-Mu. Ya Allah, kami memohon kepada-Mu syurga dan apa yang mendekatkan kepadanya baik berupa ucapan mahupun perbuatan. Dan kami berlindung kepada-Mu dari neraka dan apa yang mendekatkan kepadanya baik berupa ucapan atau perbuatan. Dan kami memohon kepada-Mu semua takdir yang Engkau tentukan baik untuk kami.",
    "meaning_en": "O Allah, we ask You for all goodness, whether we know it or not, whether it is immediate or delayed. We seek refuge in You from all evil, whether we know it or not, whether it is immediate or delayed. O Allah, we ask You for the good asked for by Your slave and Your Prophet, and we seek refuge in You from the evil sought refuge from by Your slave and Your Prophet. O Allah, we ask You for Paradise and whatever brings one closer to it in word or deed. And we seek refuge in You from the Fire and whatever brings one closer to it in word or deed. And we ask You for every decree that You have decreed concerning us to be good.",
    "category_names": [
      "Meminta Kebaikan",
      "Menolak Kejahatan",
      "Seeking Goodness",
      "Rejecting Evil",
      "Jamaah"
    ]
  },
  {
    "name_my": "Ditambahkan Kebaikan",
    "name_en": "Increase in Goodness",
    "content": "اللَّهُمَّ زِدْنَا وَلَا تَنْقُصْنَا، وَأَكْرِمْنَا وَلَا تُهِنَّا، وَأَعْطِنَا وَلَا تَحْرِمْنَا، وَآثِرْنَا وَلَا تُؤْثِرْ عَلَيْنَا، وَارْضِنَا وَارْضَ عَنَّا",
    "reference_my": "Riwayat al-Tirmizi (3173), al-Nasa'ie dalam al-Sunan al-Kubra (1443) dan Ahmad (223)",
    "reference_en": "Narrated by al-Tirmizi (3173), al-Nasa'ie in al-Sunan al-Kubra (1443) and Ahmad (223)",
    "meaning_my": "Wahai Allah! Tambahkanlah buat kami dan jangan Engkau kurangkan. Muliakanlah kami, jangan hinakan kami. Berilah buat kami, jangan dicegahnya. Pilihlah kami, jangan Engkau biarkan dan redhailah kami dan redhailah pula semua usaha kami.",
    "meaning_en": "O Allah! Add to our lives and do not take away. Honour us and do not disgrace us. Give to us and do not deprive us. Choose us and do not abandon us. Be pleased with us and be pleased with all our efforts.",
    "category_names": ["Kebaikan", "Goodness"]
  },
  {
    "name_my": "Diilhamkan Kecerdasan",
    "name_en": "Inspiration of Intelligence",
    "content": "اللَّهُمَّ أَلْهِمْنِي رُشْدِي، وَأَعِذْنِي مِنْ شَرِّ نَفْسِي",
    "reference_my": "Riwayat al-Tirmizi (3483), al-Tabarani dalam al-Du'a (1393), al-Bazzar (3580) dan al-Baihaqi dalam al-Asma' wa al-Sifat (894)",
    "reference_en": "Narrated by al-Tirmizi (3483), al-Tabarani in al-Du'a (1393), al-Bazzar (3580) and al-Baihaqi in al-Asma' wa al-Sifat (894)",
    "meaning_my": "Wahai Allah! Ilhamkanlah kepadaku kecerdasan dan petunjuk serta lindungilah aku daripada kejahatan nafsuku",
    "meaning_en": "O Allah! Inspire me with intelligence and guidance and protect me from the evil of my soul",
    "category_names": ["Kecerdasan", "Intelligence", "Ilham", "Inspiration"]
  },
  {
    "name_my": "[JEAMAAH] Diilhamkan Kecerdasan",
    "name_en": "[JAMA'AH] Inspiration of Intelligence",
    "content": "اللَّهُمَّ أَلْهِمْنَا رُشْدَنَا، وَأَعِذْنَا مِنْ شَرِّ أَنْفُسِنَا",
    "reference_my": "Riwayat al-Tirmizi (3483), al-Tabarani dalam al-Du'a (1393), al-Bazzar (3580) dan al-Baihaqi dalam al-Asma' wa Al-Sifat (894)",
    "reference_en": "Narrated by al-Tirmizi (3483), al-Tabarani in al-Du'a (1393), al-Bazzar (3580) and al-Baihaqi in al-Asma' wa Al-Sifat (894)",
    "meaning_my": "Wahai Allah! Ilhamkanlah kepada kami kecerdasan dan petunjuk serta lindungilah kami daripada kejahatan nafsu kami",
    "meaning_en": "O Allah! Inspire us with intelligence and guidance and protect us from the evil of our souls",
    "category_names": [
      "Kecerdasan",
      "Intelligence",
      "Ilham",
      "Inspiration",
      "Jamaah"
    ]
  },
  {
    "name_my": "Penghujung Umur Yang Baik",
    "name_en": "Good End of Life",
    "content": "اللَّهُمَّ اجْعَلْ خَيْرَ عُمُرِي آخِرَهُ، وَخَيْرَ عَمَلِي خَوَاتِمَهُ، وَاجْعَلْ خَيْرَ أَيَّامِي يَوْمَ أَلْقَاكَ",
    "reference_my": "Riwayat Ibn al-Sunni dalam 'Amal al-Yaum wa al-Lailah (121) dan al-Tabarani dalam al-Ausat (9411)",
    "reference_en": "Narrated by Ibn al-Sunni in 'Amal al-Yaum wa al-Lailah (121) and al-Tabarani in al-Ausat (9411)",
    "meaning_my": "Ya Allah! Jadikanlah sebaik-baik umurku adalah pada penghujungnya, dan sebaik-baik amalanku sebagai penutupnya. Dan jadikanlah sebaik-baik hariku, adalah hari dimana daku berjumpa dengan-Mu kelak.",
    "meaning_en": "O Allah! Make the best of my life its ending, and the best of my deeds its final action, and make the best of my days the day that I meet You",
    "category_names": ["Mati", "Death", "Penghujung Umur", "End of Life"]
  },
  {
    "name_my": "[JEMAAH] Penghujung Umur Yang Baik",
    "name_en": "[JAMA'AH] Good End of Life",
    "content": "اللَّهُمَّ اجْعَلْ خَيْرَ أَعْمَارِنَا أَوَاخِرَهَا، وَخَيْرَ أَعْمَالِنَا خَوَاتِمَهَا، وَاجْعَلْ خَيْرَ أَيَّامِنَا يَوْمَ نَلْقَاكَ",
    "reference_my": "Riwayat Ibn al-Sunni dalam 'Amal al-Yaum wa al-Lailah (121) dan al-Tabarani dalam al-Ausat (9411)",
    "reference_en": "Narrated by Ibn al-Sunni in 'Amal al-Yaum wa al-Lailah (121) and al-Tabarani in al-Ausat (9411)",
    "meaning_my": "Ya Allah! Jadikanlah sebaik-baik umur kami adalah pada penghujungnya, dan sebaik-baik amalan kami sebagai penutupnya. Dan jadikanlah sebaik-baik hari kami, adalah hari dimana kami berjumpa dengan-Mu kelak.",
    "meaning_en": "O Allah! Make the best of our lives its ending, and the best of our deeds its final action, and make the best of our days the day that we meet You",
    "category_names": [
      "Mati",
      "Death",
      "Penghujung Umur",
      "End of Life",
      "Jamaah"
    ]
  },
  {
    "name_my": "Elok Dalam Kesudahan Urusan",
    "name_en": "Goodness in the End of Affairs",
    "content": "اللَّهُمَّ أَحْسِنْ عَاقِبَتَنَا فِي الْأُمُورِ كُلِّهَا، وَأَجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الْآخِرَةِ",
    "reference_my": "Riwayat Ahmad (17628), al-Tabarani dalam al-Du'a (1436), al-Baihaqi dalam al-Da'awat al-Kabir (269) dan al-Hakim dalam al-Mustadrak (6508)",
    "reference_en": "Narrated by Ahmad (17628), al-Tabarani in al-Du'a (1436), al-Baihaqi in al-Da'awat al-Kabir (269) and al-Hakim in al-Mustadrak (6508)",
    "meaning_my": "Wahai Allah! Perelokkanlah kesudahan segala urusan kami, serta lindungilah kami daripada kenistaan hidup di dunia dan seksaan hidup di akhirat.",
    "meaning_en": "O Allah! Beautify the end of all our affairs, and protect us from disgrace in this world and from the punishment of the Hereafter",
    "category_names": [
      "Kesudahan Urusan",
      "End of Affairs",
      "Perelokkan",
      "Beautify"
    ]
  },
  {
    "name_my": "Mohon Keselamatan",
    "name_en": "Seeking Safety",
    "content": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ، وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "reference_my": "Riwayat Abu Daud (5088), al-Tirmizi (3388), Ibn Majah (3869), al-Nasa'ie dalam al-Sunan al-Kubra (10178) dan Ahmad (446)",
    "reference_en": "Narrated by Abu Daud (5088), al-Tirmizi (3388), Ibn Majah (3869), al-Nasa'ie in al-Sunan al-Kubra (10178) and Ahmad (446)",
    "meaning_my": "Dengan nama Allah yang dengan nama-Nya, tidak ada satu pun yang dapat memberi kemudaratan di bumi mahupun di langit. Dia-lah Yang Maha Mendengar lagi Maha Mengetahui.",
    "meaning_en": "In the name of Allah with Whose name nothing on earth or in the heavens can cause harm, and He is the All-Hearing, the All-Knowing",
    "category_names": ["Keselamatan", "Perlindungan", "Safety", "Protection"]
  },
  {
    "name_my": "Diselamatkan dari Azab",
    "name_en": "Saved from Punishment",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ النَّارِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
    "reference_my": "Riwayat al-Bukhari (1377) dan Muslim (1352)",
    "reference_en": "Narrated by al-Bukhari (1377) and Muslim (1352)",
    "meaning_my": "Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada seksa kubur, daripada azab api neraka, daripada fitnah kehidupan dan kematian, dan daripada fitnah al-Masih al-Dajjal.",
    "meaning_en": "O Allah, I seek refuge in You from the punishment of the grave, the torment of Hell, the trials of life and death, and the trial of the False Messiah",
    "category_names": ["Keselamatan", "Perlindungan", "Safety", "Protection"]
  },
  {
    "name_my": "[JEMAAH] Diselamatkan dari Azab",
    "name_en": "[JAMA'AH] Saved from Punishment",
    "content": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ النَّارِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
    "reference_my": "Riwayat al-Bukhari (1377) dan Muslim (1352)",
    "reference_en": "Narrated by al-Bukhari (1377) and Muslim (1352)",
    "meaning_my": "Ya Allah, sesungguhnya kami berlindung kepada-Mu daripada seksa kubur, daripada azab api neraka, daripada fitnah kehidupan dan kematian, dan daripada fitnah al-Masih al-Dajjal",
    "meaning_en": "O Allah, we seek refuge in You from the punishment of the grave, the torment of Hell, the trials of life and death, and the trial of the False Messiah",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Safety",
      "Protection",
      "Jamaah"
    ]
  },
  {
    "name_my": "Berlindung dari Kejahatan",
    "name_en": "Seeking Refuge from Evil",
    "content": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ شَرِّ مَا خَلَقَ",
    "reference_my": "Riwayat Muslim (2709), Abu Daud (3899), al-Tirmizi (3604), al-Nasa'ie dalam al-Sunan al-Kubra (10421), Ibn Majah (3518) dan Ahmad (7898)",
    "reference_en": "Narrated by Muslim (2709), Abu Daud (3899), al-Tirmizi (3604), al-Nasa'ie in al-Sunan al-Kubra (10421), Ibn Majah (3518) and Ahmad (7898)",
    "meaning_my": "Aku berlindung dengan kalimah-kalimah Allah yang sempurna dari kejahatan makhluk yang diciptakan-Nya",
    "meaning_en": "I seek refuge in the perfect words of Allah from the evil of what He has created",
    "category_names": ["Keselamatan", "Perlindungan", "Safety", "Protection"]
  },
  {
    "name_my": "[JEMAAH] Berlindung dari Kejahatan",
    "name_en": "[JAMA'AH] Seeking Refuge from Evil",
    "content": "نَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
    "reference_my": "Riwayat Muslim (2709), Abu Daud (3899), al-Tirmizi (3604), al-Nasa'ie dalam al-Sunan al-Kubra (10421), Ibn Majah (3518) dan Ahmad (7898)",
    "reference_en": "Narrated by Muslim (2709), Abu Daud (3899), al-Tirmizi (3604), al-Nasa'ie in al-Sunan al-Kubra (10421), Ibn Majah (3518) and Ahmad (7898)",
    "meaning_my": "Kami berlindung dengan kalimah-kalimah Allah yang sempurna dari kejahatan makhluk yang diciptakan-Nya",
    "meaning_en": "We seek refuge in the perfect words of Allah from the evil of what He has created",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Safety",
      "Protection",
      "Jamaah"
    ]
  },
  {
    "name_my": "Berlindung dari Empat Perkara",
    "name_en": "Protection from Four Things",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا",
    "reference_my": "Riwayat Muslim (7081), Abu Daud (1458), al-Tirmizi (3482), al-Nasa'ie (5536), Ibn Majah (3837) Ahmad (19402) dan Ibn Hibban (1015)",
    "reference_en": "Narrated by Muslim (7081), Abu Daud (1458), al-Tirmizi (3482), al-Nasa'ie (5536), Ibn Majah (3837) Ahmad (19402) and Ibn Hibban (1015)",
    "meaning_my": "Ya Allah! Aku berlindung dengan-Mu daripada ilmu yang tidak bermanfaat, daripada hati yang tidak khusyuk, daripada nafsu yang tidak puas, dan daripada doa yang tidak diterima.",
    "meaning_en": "O Allah! I seek refuge in You from knowledge that is of no benefit, from a heart that does not fear (You), from a soul that is never satisfied, and from a supplication that is not answered",
    "category_names": ["Keselamatan", "Perlindungan", "Safety", "Protection"]
  },
  {
    "name_my": "[JEMAAH] Berlindung dari Empat Perkara",
    "name_en": "[JAMA'AH] Protection from Four Things",
    "content": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ عِلْمٍ لَا يَنْفَعُ، وَمِنْ قَلْبٍ لَا يَخْشَعُ، وَمِنْ نَفْسٍ لَا تَشْبَعُ، وَمِنْ دَعْوَةٍ لَا يُسْتَجَابُ لَهَا",
    "reference_my": "Riwayat Muslim (7081), Abu Daud (1458), al-Tirmizi (3482), al-Nasa'ie (5536), Ibn Majah (3837) Ahmad (19402) dan Ibn Hibban (1015)",
    "reference_en": "Narrated by Muslim (7081), Abu Daud (1458), al-Tirmizi (3482), al-Nasa'ie (5536), Ibn Majah (3837) Ahmad (19402) and Ibn Hibban (1015)",
    "meaning_my": "Ya Allah! Kami berlindung dengan-Mu daripada ilmu yang tidak bermanfaat, daripada hati yang tidak khusyuk, daripada nafsu yang tidak puas, dan daripada doa yang tidak diterima.",
    "meaning_en": "O Allah! We seek refuge in You from knowledge that is of no benefit, from a heart that does not fear (You), from a soul that is never satisfied, and from a supplication that is not answered",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Safety",
      "Protection",
      "Jamaah"
    ]
  },
  {
    "name_my": "Berlindung dari Penyakit Kronik",
    "name_en": "Protection from Chronic Diseases",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الْأَسْقَامِ",
    "reference_my": "Riwayat Abu Daud (1554), Ahmad (13027), al-Nasa'ie (5493) dan Abu Ya'la (2897)",
    "reference_en": "Narrated by Abu Daud (1554), Ahmad (13027), al-Nasa'ie (5493) and Abu Ya'la (2897)",
    "meaning_my": "Ya Allah, aku berlindung dengan-Mu daripada penyakit sopak, gila, kusta dan penyakit-penyakit yang buruk.",
    "meaning_en": "O Allah, I seek refuge in You from leprosy, madness, elephantiasis, and evil diseases",
    "category_names": ["Keselamatan", "Perlindungan", "Safety", "Protection"]
  },
  {
    "name_my": "[JEMAAH] Berlindung dari Penyakit Kronik",
    "name_en": "[JAMA'AH] Protection from Chronic Diseases",
    "content": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنَ الْبَرَصِ، وَالْجُنُونِ، وَالْجُذَامِ، وَمِنْ سَيِّئِ الْأَسْقَامِ",
    "reference_my": "Riwayat Abu Daud (1554), Ahmad (13027), al-Nasa'ie (5493) dan Abu Ya'la (2897)",
    "reference_en": "Narrated by Abu Daud (1554), Ahmad (13027), al-Nasa'ie (5493) and Abu Ya'la (2897)",
    "meaning_my": "Ya Allah, kami berlindung dengan-Mu daripada penyakit sopak, gila, kusta dan penyakit-penyakit yang buruk.",
    "meaning_en": "O Allah, we seek refuge in You from leprosy, madness, elephantiasis, and evil diseases",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Safety",
      "Protection",
      "Jamaah"
    ]
  },
  {
    "name_my": "Diselamatkan dari Kemungkaran",
    "name_en": "Saved from Evil",
    "content": "اللَّهُمَّ جَنِّبْنِي مُنْكَرَاتِ الْأَخْلَاقِ، وَالْأَهْوَاءِ، وَالْأَسْوَاءِ، وَالْأَدْوَاءِ",
    "reference_my": "Riwayat al-Tirmizi (3591), Ibn Hibban (960), al-Tabarani (19/19) dan al-Bazzar (9/155)",
    "reference_en": "Narrated by al-Tirmizi (3591), Ibn Hibban (960), al-Tabarani (19/19) and al-Bazzar (9/155)",
    "meaning_my": "Ya Allah, jauhkanlah aku daripada akhlak yang mungkar, hawa nafsu, juga dari segala keburukan serta dari penyakit-penyakit yang membawa kepada kebinasaan.",
    "meaning_en": "O Allah, keep me away from evil manners, desires, and from all evil, and from the diseases that lead to destruction",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Sakit",
      "Safety",
      "Protection",
      "Disease"
    ]
  },
  {
    "name_my": "[JEMAAH] Diselamatkan dari Kemungkaran",
    "name_en": "[JAMA'AH] Saved from Evil",
    "content": "اللَّهُمَّ جَنِّبْنَا مُنْكَرَاتِ الْأَخْلَاقِ، وَالْأَهْوَاءِ، وَالْأَسْوَاءِ، وَالْأَدْوَاءِ",
    "reference_my": "Riwayat al-Tirmizi (3591), Ibn Hibban (960), al-Tabarani (19/19) dan al-Bazzar (9/155)",
    "reference_en": "Narrated by al-Tirmizi (3591), Ibn Hibban (960), al-Tabarani (19/19) and al-Bazzar (9/155)",
    "meaning_my": "Ya Allah, jauhkanlah kami daripada akhlak yang mungkar, hawa nafsu, juga dari segala keburukan serta dari penyakit-penyakit yang membawa kepada kebinasaan.",
    "meaning_en": "O Allah, keep us away from evil manners, desires, and from all evil, and from the diseases that lead to destruction",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Sakit",
      "Safety",
      "Protection",
      "Disease",
      "Jamaah"
    ]
  },
  {
    "name_my": "Menolak Bala",
    "name_en": "Rejecting Calamity",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الْأَعْدَاءِ",
    "reference_my": "Riwayat al-Bukhari (6347) dan Muslim (2707)",
    "reference_en": "Narrated by al-Bukhari (6347) and Muslim (2707)",
    "meaning_my": "Wahai Allah! Aku berlindung kepada-Mu daripada ujian yang berat, hinanya kecelakaan, buruknya takdir dan celaan para musuh (atas bala, ujian dan kecelakaan yang menimpa).",
    "meaning_en": "O Allah! I seek refuge in You from severe calamity, disgraceful calamity, evil calamity, and the scorn of enemies",
    "category_names": ["Keselamatan", "Perlindungan", "Safety", "Protection"]
  },
  {
    "name_my": "[JEMAAH] Menolak Bala",
    "name_en": "[JAMA'AH] Rejecting Calamity",
    "content": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الْأَعْدَاءِ",
    "reference_my": "Riwayat al-Bukhari (6347) dan Muslim (2707)",
    "reference_en": "Narrated by al-Bukhari (6347) and Muslim (2707)",
    "meaning_my": "Wahai Allah! Kami berlindung kepada-Mu daripada ujian yang berat, hinanya kecelakaan, buruknya takdir dan celaan para musuh (atas bala, ujian dan kecelakaan yang menimpa).",
    "meaning_en": "O Allah! We seek refuge in You from severe calamity, disgraceful calamity, evil calamity, and the scorn of enemies",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Safety",
      "Protection",
      "Jamaah"
    ]
  },
  {
    "name_my": "Agar Tidak Dihilangkan Nikmat",
    "name_en": "To Not Remove Blessings",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
    "reference_my": "Riwayat Muslim (2739) dan Abu Daud (1545)",
    "reference_en": "Narrated by Muslim (2739) and Abu Daud (1545)",
    "meaning_my": "Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada hilangnya kenikmatan yang telah Engkau berikan, daripada berubahnya kesihatan yang telah Engkau anugerahkan, daripada seksa-Mu (bencana) yang datang secara tiba-tiba, dan daripada segala bentuk kemurkaan-Mu.",
    "meaning_en": "O Allah, I seek refuge in You from the removal of Your blessings, from the change of health You have bestowed, from the sudden punishment, and from all forms of Your wrath",
    "category_names": ["Keselamatan", "Perlindungan", "Safety", "Protection"]
  },
  {
    "name_my": "[JEMAAH] Agar Tidak Dihilangkan Nikmat",
    "name_en": "[JAMA'AH] To Not Remove Blessings",
    "content": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ، وَتَحَوُّلِ عَافِيَتِكَ، وَفُجَاءَةِ نِقْمَتِكَ، وَجَمِيعِ سَخَطِكَ",
    "reference_my": "Riwayat Muslim (2739) dan Abu Daud (1545)",
    "reference_en": "Narrated by Muslim (2739) and Abu Daud (1545)",
    "meaning_my": "Ya Allah, sesungguhnya kami berlindung kepada-Mu daripada hilangnya kenikmatan yang telah Engkau berikan, daripada berubahnya kesihatan yang telah Engkau anugerahkan, daripada seksa-Mu (bencana) yang datang secara tiba-tiba, dan daripada segala bentuk kemurkaan-Mu.",
    "meaning_en": "O Allah, we seek refuge in You from the removal of Your blessings, from the change of health You have bestowed, from the sudden punishment, and from all forms of Your wrath",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Safety",
      "Protection",
      "Jamaah"
    ]
  },
  {
    "name_my": "Mohon Kurniaan dan Rahmat-Nya",
    "name_en": "Seeking His Blessings and Mercy",
    "content": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ",
    "reference_my": "Riwayat al-Tabarani dalam al-Mu'jam al-Kabir (10379) dan Abu Nu'aim dalam Hilyah al-Auliya' (7/280). Hadith ini dihukumkan sebagai sahih oleh pengarang kitab al-Silsilah al-Sahihah.",
    "reference_en": "Narrated by al-Tabarani in al-Mu'jam al-Kabir (10379) and Abu Nu'aim in Hilyah al-Auliya' (7/280). This hadith is classified as authentic by the author of al-Silsilah al-Sahihah.",
    "meaning_my": "Ya Allah, sesungguhnya aku memohon kepada-Mu agar diberi kurniaan dan rahmat-Mu. Sesungguhnya tiada yang memilikinya kecuali-Mu.",
    "meaning_en": "O Allah, I ask You for Your blessings and mercy. Indeed, no one possesses them except You",
    "category_names": ["Kurniaan", "Blessings", "Rahmat", "Mercy"]
  },
  {
    "name_my": "[JEMAAH] Mohon Kurniaan dan Rahmat-Nya",
    "name_en": "[JAMA'AH] Seeking His Blessings and Mercy",
    "content": "اللَّهُمَّ إِنَّا نَسْأَلُكَ مِنْ فَضْلِكَ وَرَحْمَتِكَ، فَإِنَّهُ لَا يَمْلِكُهَا إِلَّا أَنْتَ",
    "reference_my": "Riwayat al-Tabarani dalam al-Mu'jam al-Kabir (10379) dan Abu Nu'aim dalam Hilyah al-Auliya' (7/280). Hadith ini dihukumkan sebagai sahih oleh pengarang kitab al-Silsilah al-Sahihah.",
    "reference_en": "Narrated by al-Tabarani in al-Mu'jam al-Kabir (10379) and Abu Nu'aim in Hilyah al-Auliya' (7/280). This hadith is classified as authentic by the author of al-Silsilah al-Sahihah.",
    "meaning_my": "Ya Allah, sesungguhnya kami memohon kepada-Mu agar diberi kurniaan dan rahmat-Mu. Sesungguhnya tiada yang memilikinya kecuali-Mu.",
    "meaning_en": "O Allah, we ask You for Your blessings and mercy. Indeed, no one possesses them except You",
    "category_names": ["Kurniaan", "Blessings", "Rahmat", "Mercy", "Jamaah"]
  },
  {
    "name_my": "Berlindung dari Dukacita",
    "name_en": "Seeking Refuge from Grief",
    "content": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ",
    "reference_my": "Riwayat al-Bukhari (6369), Abu Daud (1555), al-Tirmizi (3484), al-Nasa'ie (5449) dan al-Baihaqi dalam al-Da'awat al-Kabir (305)",
    "reference_en": "Narrated by al-Bukhari (6369), Abu Daud (1555), al-Tirmizi (3484), al-Nasa'ie (5449) and al-Baihaqi in al-Da'awat al-Kabir (305)",
    "meaning_my": "Ya Allah, sesungguhnya aku berlindung kepada-Mu daripada kedukaan dan kesedihan. Aku berlindung kepada-Mu daripada sifat lemah dan malas. Aku berlindung kepada-Mu daripada sifat pengecut dan kedekut. Dan aku berlindung kepada-Mu daripada bebanan hutang dan penindasan manusia",
    "meaning_en": "O Allah, I seek refuge in You from grief and sadness, from weakness and laziness, from cowardice and miserliness, and from the burden of debt and the oppression.",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Sedih",
      "Safety",
      "Protection",
      "Grief"
    ]
  },
  {
    "name_my": "[JEMAAH] Berlindung dari Dukacita",
    "name_en": "[JAMA'AH] Seeking Refuge from Grief",
    "content": "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَنَعُوذُ بِكَ مِنَ الْعَجْزِ وَالْكَسَلِ، وَنَعُوذُ بِكَ مِنَ الْجُبْنِ وَالْبُخْلِ، وَنَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ وَقَهْرِ الرِّجَالِ",
    "reference_my": "Riwayat al-Bukhari (6369), Abu Daud (1555), al-Tirmizi (3484), al-Nasa'ie (5449) dan al-Baihaqi dalam al-Da'awat al-Kabir (305)",
    "reference_en": "Narrated by al-Bukhari (6369), Abu Daud (1555), al-Tirmizi (3484), al-Nasa'ie (5449) and al-Baihaqi in al-Da'awat al-Kabir (305)",
    "meaning_my": "Ya Allah, sesungguhnya kami berlindung kepada-Mu daripada kedukaan dan kesedihan. Kami berlindung kepada-Mu daripada sifat lemah dan malas. Kami berlindung kepada-Mu daripada sifat pengecut dan kedekut. Dan kami berlindung kepada-Mu daripada bebanan hutang dan penindasan manusia",
    "meaning_en": "O Allah, we seek refuge in You from grief and sadness, from weakness and laziness, from cowardice and miserliness, and from the burden of debt and the oppression.",
    "category_names": [
      "Keselamatan",
      "Perlindungan",
      "Sedih",
      "Safety",
      "Protection",
      "Grief",
      "Jamaah"
    ]
  },
  {
    "name_my": "Kesabaran dan Keteguhan",
    "name_en": "Patience and Steadfastness",
    "content": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
    "reference_my": "Al-Baqarah (2:250)",
    "reference_en": "Al-Baqarah (2:250)",
    "meaning_my": "Wahai Tuhan kami! Limpahkanlah sabar kepada kami, dan teguhkanlah tapak pendirian kami serta menangkanlah kami terhadap kaum yang kafir.",
    "meaning_en": "Our Lord, pour upon us patience, and make our foothold firm, and grant us victory over the disbelieving people.",
    "category_names": ["Sabar", "Teguh", "Patience", "Steadfastness"]
  },
  {
    "name_my": "Mohon Bersyukur",
    "name_en": "Seeking Gratitude",
    "content": "رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ",
    "reference_my": "Al-Naml (27:19)",
    "reference_en": "Al-Naml (27:19)",
    "meaning_my": "Wahai Tuhanku, ilhamkanlah daku supaya tetap bersyukur akan nikmat-Mu yang Engkau kurniakan kepadaku dan kepada ibu bapaku, dan supaya aku tetap mengerjakan amal soleh yang Engkau redai; dan masukkanlah daku - dengan limpah rahmat-Mu - dalam kumpulan hamba-hamba-Mu yang soleh.",
    "meaning_en": "My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve and admit me by Your mercy into [the ranks of] Your righteous servants.",
    "category_names": ["Syukur", "Gratitude"]
  },
  {
    "name_my": "Mohon Hidayah",
    "name_en": "Seeking Guidance",
    "content": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَّدُنكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ",
    "reference_my": "Ali Imran (3:8)",
    "reference_en": "Ali Imran (3:8)",
    "meaning_my": "Wahai Tuhan kami! Janganlah Engkau memesongkan hati kami sesudah Engkau beri petunjuk kepada kami, dan kurniakanlah kepada kami limpah rahmat daripada sisi-Mu; sesungguhnya Engkau jualah Tuhan Yang melimpahlimpah pemberian-Nya.",
    "meaning_en": "Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
    "category_names": ["Hidayah", "Guidance"]
  },
  {
    "name_my": "Mohon Rahmat",
    "name_en": "Seeking Mercy",
    "content": "رَبَّنَا آتِنَا مِنْ لَّدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
    "reference_my": "Al-Kahfi (18:10)",
    "reference_en": "Al-Kahfi (18:10)",
    "meaning_my": "Wahai Tuhan kami! Kurniakanlah kami rahmat dari sisi-Mu, dan berilah kemudahan serta pimpinan kepada kami untuk keselamatan agama kami.",
    "meaning_en": "Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.",
    "category_names": ["Rahmat", "Mercy"]
  },
  {
    "name_my": "Keampunan dan Doa Saudara",
    "name_en": "Forgiveness and Brother's Prayer",
    "content": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آمَنُوا، رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ",
    "reference_my": "Al-Hashr (59:10)",
    "reference_en": "Al-Hashr (59:10)",
    "meaning_my": "Wahai Tuhan Kami! Ampunkanlah dosa kami dan dosa saudara-saudara kami yang mendahului kami dalam iman, dan janganlah Engkau jadikan dalam hati kami perasaan hasad dengki dan dendam terhadap orang-orang yang beriman. Wahai Tuhan kami! Sesungguhnya Engkau Amat Melimpah Belas kasihan dan RahmatMu.",
    "meaning_en": "Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.",
    "category_names": ["Ampun", "Forgiveness", "Doa", "Prayer"]
  },
  {
    "name_my": "Menyerah Kepada-Nya",
    "name_en": "Surrendering to Him",
    "content": "رَبِّ إِنِّي لِمَا أَنْزَلْتَ إِلَيَّ مِنْ خَيْرٍ فَقِيرٌ",
    "reference_my": "Al-Qasas (28:24)",
    "reference_en": "Al-Qasas (28:24)",
    "meaning_my": "Wahai Tuhanku, sesungguhnya aku sangat berhajat kepada sebarang rezeki pemberian yang Engkau berikan.",
    "meaning_en": "My Lord, indeed I am, for whatever good You would send down to me, in need.",
    "category_names": ["Menyerah", "Surrender"]
  },
  {
    "name_my": "Doa untuk Pengantin",
    "name_en": "Prayer for the Newlyweds",
    "content": "بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
    "reference_my": "Riwayat Abu Daud (2130), al-Tirmizi (1091), Ahmad (8957), al-Nasa'i dalam al-Sunan al-Kubra (10089), al-Baihaqi dalam al-Sunan al- Kubra (14214); al-Da'awat al-Kabir (495), dan al-Hakim dalam al-Mustadrak (2745).",
    "reference_en": "Narrated by Abu Daud (2130), al-Tirmizi (1091), Ahmad (8957), al-Nasa'i in al-Sunan al-Kubra (10089), al-Baihaqi in al-Sunan al- Kubra (14214); al-Da'awat al-Kabir (495), and al-Hakim in al-Mustadrak (2745).",
    "meaning_my": "Semoga Allah memberkatimu ketika bahagia dan ketika susah, serta menghimpunkan kamu berdua dalam kebaikan.",
    "meaning_en": "May Allah bless you in happiness and in sorrow, and may He unite you in goodness.",
    "category_names": ["Pengantin", "Newlyweds"]
  },
  {
    "name_my": "Mendapat Keluarga yang Baik",
    "name_en": "Having a Good Family",
    "content": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
    "reference_my": "Al-Furqan (25:74)",
    "reference_en": "Al-Furqan (25:74)",
    "meaning_my": "Ya Tuhan kami, anugerahkanlah kepada kami isteri-isteri kami dan keturunan kami sebagai penyejuk mata (kebahagiaan hidup kami), dan jadikanlah kami imam bagi orang-orang yang bertakwa",
    "meaning_en": "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous",
    "category_names": [
      "Keturunan",
      "Offspring",
      "Isteri",
      "Wife",
      "Penyejuk",
      "Coolness",
      "Mata",
      "Eyes"
    ]
  },
  {
    "name_my": "Memohon Zuriat Soleh/Solehah",
    "name_en": "Seeking Righteous Offspring",
    "content": "رَبِّ هَبْ لِي مِنَ الصَّالِحِينَ",
    "reference_my": "Al-Saffat (37:100)",
    "reference_en": "Al-Saffat (37:100)",
    "meaning_my": "Wahai Tuhanku! Kurniakanlah kepadaku anak yang terhitung dari orang-orang yang soleh.",
    "meaning_en": "My Lord, grant me [a child] from among the righteous.",
    "category_names": ["Zuriat", "Soleh", "Solehah", "Offspring"]
  },
  {
    "name_my": "Diberkati Harta dan Keturunan",
    "name_en": "Blessing in Wealth and Offspring",
    "content": "اللَّهُمَّ أَكْثِرْ مَالِي وَوَلَدِي، وَبَارِكْ لِي فِيمَا أَعْطَيْتَنِي، وَأَطِلْ حَيَاتِي عَلَى طَاعَتِكَ، وَأَحْسِنْ عَمَلِي، وَاغْفِرْ لِي",
    "reference_my": "Riwayat al-Bukhari (6344) dan Muslim (2481) daripada Anas dengan lafaz \"اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ\"، manakala lafaz \"وَأَطِلْ حَيَاتَهُ وَاغْفِرْ لَهُ\" diriwayatkan oleh al-Bukhari dalam *al-Adab al-Mufrad* (653), Ibn Sa'ad dalam *al-Tabaqat al-Kubra* (8451), dan Abu Ya'la (4236).",
    "reference_en": "Narrated by al-Bukhari (6344) and Muslim (2481) from Anas with the words \"اللَّهُمَّ أَكْثِرْ مَالَهُ وَوَلَدَهُ، وَبَارِكْ لَهُ فِيمَا أَعْطَيْتَهُ\", while the words \"وَأَطِلْ حَيَاتَهُ واغْفِرْ لَهُ\" are narrated by al-Bukhari in *al-Adab al-Mufrad* (653), Ibn Sa'ad in *al-Tabaqat al-Kubra* (8451), and Abu Ya'la (4236).",
    "meaning_my": "Ya Allah, perbanyaklah harta dan anakku serta berkatilah kurniaan yang Engkau berikan padaku. Panjangkanlah umurku dalam ketaatan pada-Mu dan baikkanlah amalku serta ampunilah dosa-dosaku.",
    "meaning_en": "O Allah, increase his wealth and offspring, and bless him in what You have given him. Prolong his life in obedience to You, and make his deeds good, and forgive his sins.",
    "category_names": [
      "Harta",
      "Wealth",
      "Keturunan",
      "Offspring",
      "Berkat",
      "Blessing"
    ]
  },
  {
    "name_my": "Kebaikan Dunia dan Akhirat",
    "name_en": "Goodness in This World and the Hereafter",
    "content": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ",
    "reference_my": "Al-Baqarah (2:201)",
    "reference_en": "Al-Baqarah (2:201)",
    "meaning_my": "Ya Tuhan kami, berikanlah kami kebaikan di dunia dan kebaikan di akhirat, dan peliharalah kami daripada azab neraka.",
    "meaning_en": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.",
    "category_names": [
      "Dunia",
      "World",
      "Akhirat",
      "Hereafter",
      "Kebaikan",
      "Goodness"
    ]
  }
]
